// topic configs配置数据
const { require, baseUrl } = exports;
const path = require("path");
// const fs = require("fs");
// const multipart = require("connect-multiparty");
// var multipartMiddleware = multipart();

const {
  randomNumber,
  pluckRandom,
  pluckSome,
  genOptions,
  delay,
} = require("./utils/index.js");
// const requireFile = require("./utils/require.js");
const dataPath = path.join(baseUrl, "../data.js");
// const data = requireFile(dataPath);
// const { noGoalNoAbData, noGoalHasAbData, goalAndAbData, goalsNoAbData } = data;
// console.log('createFile:',)
exports.dataPaths = [dataPath];
exports.routes = [
  {
    url: "/topic/configs",
    method: "get",
    handler: async (ctx) => {
      console.log("request body is:", ctx.request.boody);
      await delay(1000);
      ctx.body = {
        code: 0,
        message: "",
        data: {
          project_id: 1,
          id: null,
          name: "ssd",
          comment: "",
          type: "topic",
          action: "save",
          configs: {
            project_id: 1,
            filters: {
              relTag: "and",
              children: [],
            },
            value: "aop.ods_aop",
            time: {
              type: "relative",
              start: "2023/4/17 0:0:0",
              end: "2023/4/23 23:59:59",
              recent_day: "1-7",
              checked: false,
            },
            topicCount: "auto",
            promptWords: ["ss"],
            split: false,
          },
        },
      };
    },
  },

  //topic chart数据
  {
    url: "/topic/chart",
    method: "get",
    handler: async (ctx) => {
      console.log("request body is:", ctx.request.boody);
      await delay(1000);
      ctx.body = {
        code: 0,
        message: "",
        data: {
          status: 3,
          chartData: [],
        },
      };
    },
  },

  //topic table数据
  {
    url: "/topic/table",
    method: "get",
    handler: async (ctx) => {
      console.log("request body is:", ctx.request.boody);
      await delay(1000);
      ctx.body = {
        code: 0,
        message: "",
        data: {
          positive: {
            count: 250,
            percent: "6.83%",
            data: [
              {
                content:
                  "#抽奖[超话]# 推推追忆通贩圆 烫热有余大人们请[老师好] ​​​",
                channel: "weibo",
                time: "2023-04-19 23:57:21",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#再来推推，余量健康！妈咪们看看叭 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:41:36",
              },
              {
                content: "#偶像梦幻祭[超话]#推推[老师好][老师好] ​​​",
                channel: "weibo",
                time: "2023-04-19 23:15:48",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推通贩圆，就差一口英智和千秋就可以成配啦[羞嗒嗒] ​​​",
                channel: "weibo",
                time: "2023-04-19 22:57:32",
              },
              {
                content: "#偶像梦幻祭[超话]#推推口罩！开100！ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:29:56",
              },
              {
                content: "#偶像梦幻祭[超话]#推推口罩！开100！ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:24:42",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 【推车】推推原菲五奇人活动通贩圆\n很好说话  感兴趣的咪戳我[抱一抱] ​​​",
                channel: "weibo",
                time: "2023-04-19 22:19:21",
              },
              {
                content: "#偶像梦幻祭[超话]#推推[打call][打call] ​​​",
                channel: "weibo",
                time: "2023-04-19 22:14:06",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推花契[羞嗒嗒]走最后一批～\n妈咪们快来看看救救余量[苦涩] ​​​",
                channel: "weibo",
                time: "2023-04-19 22:07:58",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n继续推推，涉妈宗妈救救我们，零酱滞销妈咪们一口也是爱[泪][泪]\n囤货安徽非偏6-10，前三配保配您来了就能吃到 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:06:39",
              },
              {
                content: "#偶像梦幻祭[超话]#推推新团妈位，问！都可以问！ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:06:27",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推花之契约吧唧！！烫热皆有余[泪][泪] ​​​",
                channel: "weibo",
                time: "2023-04-19 21:46:10",
              },
              {
                content: "#偶像梦幻祭[超话]#推推口罩！开100！ ​​​",
                channel: "weibo",
                time: "2023-04-19 21:45:17",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推花契\n妈咪不来一口嘛[爱你] ​​​",
                channel: "weibo",
                time: "2023-04-19 21:43:19",
              },
              {
                content: "#偶像梦幻祭[超话]#推推游木真mako好价拼盘！！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 21:34:14",
              },
              {
                content: "#偶像梦幻祭[超话]#推推[打call] ​​​",
                channel: "weibo",
                time: "2023-04-19 21:25:54",
              },
              {
                content: "#偶像梦幻祭[超话]#推推推，有没有妈咪[泪][泪] ​​​",
                channel: "weibo",
                time: "2023-04-19 21:24:17",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#最后推推，花前差栗或露就能成，来吃一口吧[泪][泪]不然花前就要流了[苦涩] ​​​",
                channel: "weibo",
                time: "2023-04-19 21:20:06",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推口罩拼队走，2的倍数排可单角色[打call]\n同时团内长期开es谷与精选es同人谷，欢迎咪来！[心][心][心] ​​​",
                channel: "weibo",
                time: "2023-04-19 21:17:59",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推余量[淚][淚][淚][淚] ​​​",
                channel: "weibo",
                time: "2023-04-19 20:56:03",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推固团妈位！\n这里还转北和毛的分妈（实在是没钱了啊啊啊）！前面也吃了cover拍立得和新v3拍立得（定金已付）可以各送两配只需补尾！接位咪想吃花契也可以送一配！\n占tag致歉 冰鹰北斗 衣更真绪 ​​​",
                channel: "weibo",
                time: "2023-04-19 20:12:08",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推，余量多多，妈咪们走过路过不要错过[羞嗒嗒][羞嗒嗒][羞嗒嗒] ​​​",
                channel: "weibo",
                time: "2023-04-19 19:48:36",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推 团内还有妈位 顺便转转团内英亲[泪][泪][泪] ​​​",
                channel: "weibo",
                time: "2023-04-19 17:59:57",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推v3拍立得余量喔\n你一口我一口大家都开心吃谷啦[送花花]\n妈咪看看我qwq\n\n借tag：偶像梦幻祭 天祥院英智 日日树涉 姬宫桃李 伏见弓弦 明星昴流 冰鹰北斗 游木真 衣更真绪 守泽千秋 深海奏汰 南云铁虎 仙石忍 高峯翠  礼濑真宵 朔间零 羽风薰 大神晃牙 阿多尼斯 神崎飒马 鬼龙红 ​​​",
                channel: "weibo",
                time: "2023-04-19 17:26:47",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推奇人通贩圆 马上就成啦 咪们快来吃一口吧[泪][泪] ​​​",
                channel: "weibo",
                time: "2023-04-19 16:47:06",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#做图忘记打括号啦！爱拉是备捆！推推妈咪们看看呀[泪][泪] ​​​",
                channel: "weibo",
                time: "2023-04-19 16:27:45",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推通贩圆，咪们看看，宗咪夏咪看看前两配稳😭 ​​​",
                channel: "weibo",
                time: "2023-04-19 16:09:36",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推固团凹妈位！[好喜欢] ​​​",
                channel: "weibo",
                time: "2023-04-19 15:48:58",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推通贩圆，不需要对走，无捆[憧憬]\nngs花后真的没妈吃吗[泪][泪][泪][泪]\n求求大人们来口吧[泪][泪] ​​​",
                channel: "weibo",
                time: "2023-04-19 15:13:14",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推这个 有没有零妈来吃吃[泪][泪][泪][泪] ​​​",
                channel: "weibo",
                time: "2023-04-19 14:19:50",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推，纺余2，同团还可以排这次的口罩 ​​​",
                channel: "weibo",
                time: "2023-04-19 14:07:59",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推元菲奇人巡演通贩圆！吃就成，请助力！[哇][哇][哇] ​​​",
                channel: "weibo",
                time: "2023-04-19 13:51:33",
              },
              {
                content: "推推，余量健康，妈咪们看看#偶像梦幻祭[超话]# ​​​",
                channel: "weibo",
                time: "2023-04-19 13:32:15",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推奇人通贩马上就成啦[打call] ​​​",
                channel: "weibo",
                time: "2023-04-19 12:51:12",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#不要吞我不要吞我不要吞我！！推推车，all任意角色可包邮，英all走只需支付尾款[泪][泪]来看看吧[泪][泪][泪]\n日日树涉 深海奏汰 天祥院英智 ​​​",
                channel: "weibo",
                time: "2023-04-19 12:49:18",
              },
              {
                content:
                  "#偶像梦幻祭[超话]##偶像梦幻祭[超话]#\n推推奇人通贩圆 暴调无捆调价参考cwz \n顺便找拼团，想要12配零花后，对走也ok，出调价的优先♡⑅⃝◌꒰ ⑅ ˘̤ з꒰ ˃̶̤⌄˂̶̤ `  ू꒱◌⑅⃝♡ ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 12:48:39",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推通贩圆[老师好]囤货广州 ​​​",
                channel: "weibo",
                time: "2023-04-19 12:46:49",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推通贩圆，前十配有人包尾[羞嗒嗒][羞嗒嗒] ​​​",
                channel: "weibo",
                time: "2023-04-19 12:45:25",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推拼煤！齐了立切[送花花]ngs妈看看 乱凪砂 ​​​",
                channel: "weibo",
                time: "2023-04-19 11:46:58",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推团内在开和掉落，欢迎妈咪们来吃[爱你] ​​​",
                channel: "weibo",
                time: "2023-04-19 11:27:36",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推元菲五奇人新通贩圆，不对走，定尾，团内稳定开谷 ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 11:04:04",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推新通贩圆 有没有涉p救救 团内菲涅常年三缺一调价可议很好说话[报税] ​​​",
                channel: "weibo",
                time: "2023-04-19 10:57:51",
              },
              {
                content:
                  "推推！五奇人元菲通贩圆！！！\n花前日和余量充足！想吃一口的咪可以看看！！\n\n#偶像梦幻祭[超话]##ensemblestars# ​​​",
                channel: "weibo",
                time: "2023-04-19 10:36:28",
              },
              {
                content: "#偶像梦幻祭[超话]#\n推推！[馋嘴] ​​​",
                channel: "weibo",
                time: "2023-04-19 08:43:52",
              },
              {
                content: "#偶像梦幻祭[超话]#大人们早上好！推推车嘿嘿 ​​​",
                channel: "weibo",
                time: "2023-04-19 08:43:23",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推推 诚邀妈咪们助力每一个梦想[抱一抱][抱一抱] ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 07:36:18",
              },
              {
                content: "#偶像梦幻祭[超话]#推推！！[送花花] ​​​",
                channel: "weibo",
                time: "2023-04-19 07:34:47",
              },
              {
                content: "#偶像梦幻祭[超话]#推推同团通贩圆～[打call] ​​​",
                channel: "weibo",
                time: "2023-04-19 07:15:47",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推推推 puka妈宗妈来看看来看看最后一点余量了助力成团 凹余就送谷[舔屏][舔屏] ​​​",
                channel: "weibo",
                time: "2023-04-19 06:53:29",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推奇人元菲通贩圆[羞嗒嗒]开五配 均价25.6 不对走 妈咪们走过路过来吃一口吧 团内稳定开谷 氛围很好 ​​​",
                channel: "weibo",
                time: "2023-04-19 06:24:27",
              },
            ],
          },
          negative: {
            count: 399,
            percent: "10.90%",
            data: [
              {
                content: "#偶像梦幻祭[超话]#推推口罩！有无真妈助力！ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:49:58",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推泉麻油个衣通贩圆掉落，只需要付尾款，泉麻需1k1 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:40:57",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 妈咪成团就差您一口！ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:36:13",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推五奇人，元菲通贩圆！刚开没多久，烫热有余！温调！妈咪来口！ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:22:37",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推奇人元非通贩圆！\n欢迎大人们来吃！\n[干饭人][干饭人][干饭人][干饭人] ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:09:46",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 茨泉个衣盒掉落 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:03:51",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推车！纺妈来救救！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:02:30",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推!宗妈puka妈快来!差您一口成配啦! ​​​",
                channel: "weibo",
                time: "2023-04-19 23:02:20",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推五奇人/元菲通贩圆吧唧  温调有捆 囤货地河北 只差您一口[悲伤][悲伤] ​​​",
                channel: "weibo",
                time: "2023-04-19 23:00:40",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推团内掉落！！标价是一对全款！！\n泉麻一捆一，零不捆！不捆！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:32:14",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推新奇人原菲巡演通贩圆\n大人快来吃一口！这么美真的不吃吗！我们成团就差您了大人！ ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:18:17",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推新奇人原菲巡演通贩圆\n大人快来吃一口！这么美真的不吃吗！我们成团就差您了大人！ ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:18:02",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推新奇人原菲巡演通贩圆\n大人快来吃一口！这么美真的不吃吗！我们成团就差您了大人！ ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:16:57",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推新奇人原菲巡演通贩圆\n大人快来吃一口！这么美真的不吃吗！我们成团就差您了大人！ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:15:44",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推通贩圆妈咪来口吗\n先排后调，二调差距根一调＞3可撤\n排量如图，妈咪来口吧🥺 ​​​",
                channel: "weibo",
                time: "2023-04-19 21:51:38",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推通贩圆妈咪来口吗\n先排后调，二调差距根一调＞3可撤\n排量如图，妈咪来口英吧🥺 ​​​",
                channel: "weibo",
                time: "2023-04-19 21:49:23",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推通贩圆妈咪来口吗\n先排后调，二调差距根一调＞3可撤\n排量如图，妈咪来口英吧🥺 ​​​",
                channel: "weibo",
                time: "2023-04-19 21:42:08",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推岚咪个衣通贩圆。求个兔妈来救一下啊，您得一口是我们成配的希望！ ​​​",
                channel: "weibo",
                time: "2023-04-19 21:40:04",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推通贩圆妈咪来口吗\n先排后调，二调差距根一调＞3可撤\n排量如图，妈咪来口英吧🥺 ​​​",
                channel: "weibo",
                time: "2023-04-19 21:37:32",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推通贩圆\n咪来口英嘛，爆调无捆\n二调可撤 ​​​",
                channel: "weibo",
                time: "2023-04-19 21:34:17",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推五奇人元菲通贩圆（挥舞双手）来恰一口！如果无捆成了还会暴调 ​​​",
                channel: "weibo",
                time: "2023-04-19 21:30:48",
              },
              {
                content: "#偶像梦幻祭[超话]#推推，暴调无捆 ​​​",
                channel: "weibo",
                time: "2023-04-19 21:21:32",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推通贩圆，图为排量，团内调价较温，成几开几，妈咪们来看看！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 21:21:26",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推元菲五奇人通贩圆，花前花后开5不对走——\n烫热有余！！\n上海囤货，非偏远5-8。\n\ntag：朔间零 日日树涉 深海奏汰 斋宫宗 巴日和    逆先夏目 青叶纺 天祥院英智 乱凪砂 ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 21:17:05",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推pld和通贩圆同团，囤货江苏\n零花后puka日和涉夏都有余\n咪们路过看看来口 ​​​[可怜] ​​​",
                channel: "weibo",
                time: "2023-04-19 20:53:41",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推好价ngs日七和亚克力，已切煤\n就等你来吃口美丽ngs\n上海囤货，群里超多好价等你来吃 ​​​",
                channel: "weibo",
                time: "2023-04-19 20:35:19",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推新通贩圆 武汉囤货会二调  不对走 ​​​",
                channel: "weibo",
                time: "2023-04-19 20:27:42",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推奇人元菲巡演的新通贩圆，对走定尾，上调下余，烫热有余 ​​​",
                channel: "weibo",
                time: "2023-04-19 20:26:31",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推———妈咪们看看！零滞销了！！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 20:25:01",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推奇人元菲巡演的新通贩圆，对走定尾，上调下余，烫热有余 ​​​",
                channel: "weibo",
                time: "2023-04-19 20:07:41",
              },
              {
                content: "#偶像梦幻祭[超话]#推推通贩圆和日七扑克掉落 ​​​",
                channel: "weibo",
                time: "2023-04-19 19:39:15",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 为什么总是发不进来[苦澀]手速团推推哪个小偶像的咪都缺 ​​​",
                channel: "weibo",
                time: "2023-04-19 19:07:59",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推新通贩圆，非偏邮6r，同群有妈位可排，团长成年无瓜已工作，其他管理均成年，开团两年，绝大部分谷子都自动上表，来就享受一键成团 ​\np3群内掉落 ​​​",
                channel: "weibo",
                time: "2023-04-19 18:53:35",
              },
              {
                content: "#偶像梦幻祭[超话]#推推群内一代塔罗掉落，只肾尾款 ​​​",
                channel: "weibo",
                time: "2023-04-19 18:53:12",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推花契吧唧（均22.5-）和新通贩圆～\n 托妈流星队妈斑妈宗妈看看咱！！！\n❗️新通贩圆调捆已定\n❗️宗老师怎么也一动不动了啊啊啊啊啊！！\n❗️群里无宗妈，宗妈看看咱！！！！！\n❗️团内招算捆余量管理咪，看看咱\n开10未标余10，烫热有很多余咪们看看～ ​​​",
                channel: "weibo",
                time: "2023-04-19 18:44:41",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推奇人原菲通贩和团内掉落\n妈咪们看看通贩bt定尾不伤肾😢 ​​​",
                channel: "weibo",
                time: "2023-04-19 18:23:49",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#再来推推！——妈咪们看看助力无捆成配 ​​​",
                channel: "weibo",
                time: "2023-04-19 18:13:05",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推\n\n美丽余量！！有没有涉妈日和妈夏妈来吃一口！！！\n\n只要咪来吃一口，你推梦情天天有！！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 18:03:46",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推追忆奇人元菲通贩圆！！！暴调无捆！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 17:51:27",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推团里掉落，对走，标价是全款\n泉一捆一，麻油一捆一，零二捆一 ​​​",
                channel: "weibo",
                time: "2023-04-19 16:00:42",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推奇人元fine通贩圆[羞嗒嗒]调价已出，上调下余，不对走 ​​​",
                channel: "weibo",
                time: "2023-04-19 15:48:09",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推花契吧唧（均22.5-）和新通贩圆～\n 托妈流星队妈斑妈宗妈看看咱！！！\n❗️新通贩圆调捆已定\n❗️宗老师怎么也一动不动了啊啊啊啊啊！！！\n❗️群里无宗妈，宗妈看看咱！！！！\n开10未标余10，烫热有很多余咪们看看～ ​​​",
                channel: "weibo",
                time: "2023-04-19 15:47:29",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推转单，妈咪们助力我跑路吧，都在同一个群 ​​​",
                channel: "weibo",
                time: "2023-04-19 15:46:57",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n继续推推元菲奇人通贩圆\n余量健康\n涉妈ngs妈日和妈来一口吧\n不对走，马上就成了 ​​​",
                channel: "weibo",
                time: "2023-04-19 15:40:33",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推同团，岚盒爆调无捆，\n奇人原菲通贩圆温调宗妈ngs妈看看啊啊啊啊[苦涩][苦涩] ​​​",
                channel: "weibo",
                time: "2023-04-19 15:23:05",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推，凹任意角色包邮，凹英只需支付尾款\n大眼不要再吞我了！！！不要！\n天祥院英智  日日树涉  深海奏汰 ​​​",
                channel: "weibo",
                time: "2023-04-19 14:55:02",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推自己的退坑出物，3r一张3r一张签不单出，图五赠品随机塞\n咪们看看吧 ​​​",
                channel: "weibo",
                time: "2023-04-19 14:31:11",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推群内通贩圆🧎\n开3不对走，选柄自由您值得拥有🌹 ​​​",
                channel: "weibo",
                time: "2023-04-19 14:22:13",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推团内余量\n花契和元菲奇人通贩圆！\n妈咪请吃！ ​​​",
                channel: "weibo",
                time: "2023-04-19 13:59:10",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推，深海奏汰余2，现在预调的-7。就差这两口啦！！！ ​​​",
                channel: "weibo",
                time: "2023-04-19 13:21:54",
              },
            ],
          },
          others: {
            count: 3013,
            percent: "82.28%",
            data: [
              {
                content: "#偶像梦幻祭[超话]# 推推新通贩圆 团长包尾80配 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:58:08",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推樱花亚克力，群内妈位有余，余量私聊\n图一调价 图二余量 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:56:40",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:51:32",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:51:32",
              },
              {
                content: "#偶像梦幻祭[超话]#推推花之契约吧唧[兔子] ​​​",
                channel: "weibo",
                time: "2023-04-19 23:51:17",
              },
              {
                content: "#偶像梦幻祭[超话]#t推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:51:07",
              },
              {
                content: "#偶像梦幻祭[超话]#推推~ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:48:45",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推推TT ​​​",
                channel: "weibo",
                time: "2023-04-19 23:47:40",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:46:20",
              },
              {
                content: "#偶像梦幻祭[超话]#推推元菲五奇人通贩圆 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:46:10",
              },
              {
                content: "#偶像梦幻祭[超话]#\n\n推推一代ins卡余量，又泉 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:45:57",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:45:42",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:38:59",
              },
              {
                content: "#偶像梦幻祭[超话]#推推通贩圆 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:38:42",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:38:38",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#别限流了啊 推推巡演通贩圆五奇人元菲 对走 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:37:33",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:35:50",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:35:26",
              },
              {
                content: "推推花奏吧唧#吧唧##偶像梦幻祭[超话]# ​​​",
                channel: "weibo",
                time: "2023-04-19 23:34:44",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推樱花亚克力纪念挂件和花之契约吧唧徽章\n预计均价22-\n同群\n\n致歉🙇🏻‍♀️Tag天满光明星昴流衣更真绪深海奏汰南云铁虎高峯翠三毛缟斑莲己敬人鬼龙红郎月永雷欧葵日向葵裕太青叶纺春川宙守泽千秋仙石忍影片美伽咪朔间零朔间凛月仁兔成鸣朱樱司濑名泉鸣上岚冰鹰北斗宗阿多羽风 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:31:04",
              },
              {
                content: "推推花奏吧唧#偶像梦幻祭[超话]#\np1余量p2调价 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:30:02",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推个人通贩圆\n救救濑名泉，朔间零，礼濑真宵，白鸟蓝良——\n救救——— ​​​",
                channel: "weibo",
                time: "2023-04-19 23:28:28",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推花契吧唧\n冰鹰北斗 游木真 深海奏汰 守泽千秋 仙石忍 高峯翠 南云铁虎 七种茨 乱凪砂 巴日和 涟纯 斋宫宗 影片美伽  乙狩阿多尼斯 羽风薰 大神晃牙 紫之创 仁兔成鸣 真白友也 天满光 莲巳敬人 鬼龙红郎 神崎飒马 朱樱司 ，月永雷欧 濑名泉 朔间凛月 鸣上岚 逆先夏目 春川宙 青 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:24:52",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推同团 明天出五奇人+元菲box调价后可撤排[awsl] ​​​",
                channel: "weibo",
                time: "2023-04-19 23:23:04",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n替友推推通贩圆余量\n各位妈咪救救——— ​​​",
                channel: "weibo",
                time: "2023-04-19 23:23:03",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推奇人通贩圆—— ​​​",
                channel: "weibo",
                time: "2023-04-19 23:19:04",
              },
              {
                content: "#偶像梦幻祭[超话]#\n推推车——妈咪们！请吃！ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:16:58",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推新团~新谷都有开每个月也会抽人送小礼物~~！妈咪们走过路过不要错过！ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:16:21",
              },
              {
                content: "#偶像梦幻祭[超话]#推推五奇人+元菲通贩圆～ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:15:36",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:09:57",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#\n推推同团，路过的妈咪如果感兴趣请务必dd我发群号哦！！lovelove！ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:09:29",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推新个衣和元菲奇人通贩圆——调价在p2还剩敬人和岚姐来妈咪吃一口———— ​​​",
                channel: "weibo",
                time: "2023-04-19 23:09:04",
              },
              {
                content: "#偶像梦幻祭[超话]#\n推推车 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:07:56",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:07:08",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推茨个衣通贩圆掉落产物，仅肾尾款（图上红字，价格为一对）立肾\n朔间零 濑名泉 礼濑真宵 白鸟蓝良 ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 23:07:04",
              },
              {
                content: "#偶像梦幻祭[超话]#推推通贩圆 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:06:06",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推 同团 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:04:58",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推茨个衣通贩圆掉落产物，仅肾尾款（图上红字，价格为一对）立肾\n朔间零 濑名泉 礼濑真宵 白鸟蓝良 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:04:35",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# 推推cover pld余量，还余图上琥珀、美伽、创、薰、晃牙、宙，求求来个咪吃一口。 ​​​",
                channel: "weibo",
                time: "2023-04-19 23:04:14",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推通贩圆[送花花][送花花][送花花] ​​​",
                channel: "weibo",
                time: "2023-04-19 23:01:09",
              },
              {
                content: "#偶像梦幻祭[超话]#推推拼煤 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:57:36",
              },
              {
                content: "#偶像梦幻祭[超话]#推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:55:36",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推冬通贩加成通贩圆 ​​​，囤货地辽宁 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:47:28",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推奇人元菲通贩圆w\n团长成年靠谱（之前的cd柄通贩圆已到货可发，供参考）\n\n搜索用：斋宫宗 乱凪砂 巴日和 天祥院英智 ​ ​​​",
                channel: "weibo",
                time: "2023-04-19 22:47:06",
              },
              {
                content: "#偶像梦幻祭[超话]# \n推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:45:02",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推团里元菲奇人通贩圆，已经无捆了！英妈们来救救！团里还有一配的五奇人花前花后，群号图上，加不了请私我 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:44:46",
              },
              {
                content: "#偶像梦幻祭[超话]#推推五奇人元菲通贩圆 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:44:35",
              },
              {
                content:
                  "#偶像梦幻祭[超话]#推推微信扫街呀，一周去三次，神户垃圾屋，乙女馆等什么的都会囤货地广州，6汇 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:40:25",
              },
              {
                content: "#偶像梦幻祭[超话]# 推推 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:40:22",
              },
              {
                content:
                  "#偶像梦幻祭[超话]# \n推推元菲奇人通贩圆余量\n涉妈ngs妈日和妈快来吃口吧 ​​​",
                channel: "weibo",
                time: "2023-04-19 22:40:21",
              },
            ],
          },
        },
      };
    },
  },

  //topic detail数据
  {
    url: "/topic/detail",
    method: "get",
    handler: async (ctx) => {
      console.log("request body is:", ctx.request.boody);
      await delay(1000);
      ctx.body = {
        code: 0,
        message: "",
        data: {
          status: 3,
          list: [
            {
              id: "4892378600834920",
              channel: "weibo",
              type: "micro_blog",
              content:
                "#抽奖[超话]#花前纺哥真的没人来吗，同群还有成几开几！团内气氛良好，稳定开谷，还有走bt的通贩圆花前花后各一余五奇人\ntag：元菲 五奇人 通贩圆 青叶纺 ​​​",
              authorId: "7605570451",
              authorName: "Anielir",
              emotion: "positive",
              ABAS: '[{"aspect": "花前纺哥", "opinions": ["没人来"], "sentiment_polarity": ["负向"]}]',
              others:
                '{"region_name": "发布于 浙江", "reposts_count": 0, "comments_count": 0, "attitudes_count": 0}',
              link: "https://m.weibo.cn/detail/4892378600834920",
              publishTime: "2023-04-19 23:17:05",
              collectionTime: "2023-04-19 23:17:05",
            },
          ],
          pager: {
            total: 130,
            pageSize: 10,
            curPage: 1,
          },
          filterOptions: {
            channel: [
              {
                value: "weibo",
                label: "微博",
              },
            ],
          },
        },
      };
    },
  },
];
